In [999]:
# Groupby is gonna group togethar the values in a column and display them all on the same row and it allows to perform aggregate function on those groupings
import pandas as pd
df=pd.read_csv('Flavors.csv')
df

,Flavor,Base Flavor,Liked,Flavor Rating,Texture Rating,Total Rating
0,Mint Chocolate Chip,Vanilla,Yes,10.0,8.0,18.0
1,Chocolate,Chocolate,Yes,8.8,7.6,16.6
2,Vanilla,Vanilla,No,4.7,5.0,9.7
3,Cookie Dough,Vanilla,Yes,6.9,6.5,13.4
4,Rocky Road,Chocolate,Yes,8.2,7.0,15.2
5,Pistachio,Vanilla,No,2.3,3.4,5.7
6,Cake Batter,Vanilla,Yes,6.5,6.0,12.5
7,Neapolitan,Vanilla,No,3.8,5.0,8.8
8,Chocolte Fudge Brownie,Chocolate,Yes,8.2,7.1,15.3

In [1000]:
# As the Flavor has all the unique values so we are not grouping on its basis
group_by_frame=df.groupby('Base Flavor').mean(numeric_only=True)
group_by_frame

             Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate              8.4        7.233333         15.70
Vanilla                5.7        5.650000         11.35

In [1001]:
group_by_frame=df.groupby('Base Flavor').sum(numeric_only=True)
group_by_frame

             Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate             25.2            21.7          47.1
Vanilla               34.2            33.9          68.1

In [1002]:
group_by_frame=df.groupby('Base Flavor').count()
group_by_frame

             Flavor  Liked  Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate         3      3              3               3             3
Vanilla           6      6              6               6             6

In [1003]:
group_by_frame=df.groupby('Base Flavor').min()
group_by_frame

                  Flavor Liked  Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate      Chocolate   Yes            8.2             7.0          15.2
Vanilla      Cake Batter    No            2.3             3.4           5.7

In [1004]:
group_by_frame=df.groupby('Base Flavor').max()
group_by_frame

                 Flavor Liked  Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate    Rocky Road   Yes            8.8             7.6          16.6
Vanilla         Vanilla   Yes           10.0             8.0          18.0

In [1005]:
group_by_frame=df.groupby('Base Flavor').agg({'Flavor Rating':['mean','max','count','sum']})
group_by_frame

            Flavor Rating
                     mean   max count   sum
Base Flavor
Chocolate             8.4   8.8     3  25.2
Vanilla               5.7  10.0     6  34.2

In [1006]:
group_by_frame=df.groupby('Base Flavor').agg({'Flavor Rating':['mean','max','count','sum'], "Texture Rating":['mean','max','count','sum']})
group_by_frame

            Flavor Rating                   Texture Rating
                     mean   max count   sum           mean  max count   sum
Base Flavor
Chocolate             8.4   8.8     3  25.2       7.233333  7.6     3  21.7
Vanilla               5.7  10.0     6  34.2       5.650000  8.0     6  33.9

#### Grouping on multiple columns

In [1007]:
df

,Flavor,Base Flavor,Liked,Flavor Rating,Texture Rating,Total Rating
0,Mint Chocolate Chip,Vanilla,Yes,10.0,8.0,18.0
1,Chocolate,Chocolate,Yes,8.8,7.6,16.6
2,Vanilla,Vanilla,No,4.7,5.0,9.7
3,Cookie Dough,Vanilla,Yes,6.9,6.5,13.4
4,Rocky Road,Chocolate,Yes,8.2,7.0,15.2
5,Pistachio,Vanilla,No,2.3,3.4,5.7
6,Cake Batter,Vanilla,Yes,6.5,6.0,12.5
7,Neapolitan,Vanilla,No,3.8,5.0,8.8
8,Chocolte Fudge Brownie,Chocolate,Yes,8.2,7.1,15.3

In [1008]:
df.groupby(['Base Flavor','Liked']).mean(numeric_only=True)

                   Flavor Rating  Texture Rating  Total Rating
Base Flavor Liked
Chocolate   Yes              8.4        7.233333     15.700000
Vanilla     No               3.6        4.466667      8.066667
            Yes              7.8        6.833333     14.633333

In [1009]:
df.groupby(['Base Flavor','Liked']).agg({'Flavor Rating':['mean','max','count','sum'], "Texture Rating":['mean','max','count','sum']})

                  Flavor Rating                   Texture Rating             \
                           mean   max count   sum           mean  max count
Base Flavor Liked
Chocolate   Yes             8.4   8.8     3  25.2       7.233333  7.6     3
Vanilla     No              3.6   4.7     3  10.8       4.466667  5.0     3
            Yes             7.8  10.0     3  23.4       6.833333  8.0     3


                    sum
Base Flavor Liked
Chocolate   Yes    21.7
Vanilla     No     13.4
            Yes    20.5

In [1010]:
df.groupby('Base Flavor').describe() # It is just a generalized function showing summary

            Flavor Rating                                             \
                    count mean       std  min    25%  50%  75%   max
Base Flavor
Chocolate             3.0  8.4  0.346410  8.2  8.200  8.2  8.5   8.8
Vanilla               6.0  5.7  2.710719  2.3  4.025  5.6  6.8  10.0

            Texture Rating            ...             Total Rating         \
                     count      mean  ...    75%  max        count   mean
Base Flavor                           ...
Chocolate              3.0  7.233333  ...  7.350  7.6          3.0  15.70
Vanilla                6.0  5.650000  ...  6.375  8.0          6.0  11.35


                  std   min     25%   50%     75%   max
Base Flavor
Chocolate    0.781025  15.2  15.250  15.3  15.950  16.6
Vanilla      4.263684   5.7   9.025  11.1  13.175  18.0

[2 rows x 24 columns]

### **1: Data Thinkers**  
### Practice Groupby

- It is used to split the data into groups based on some Criteria. So, we can perform the analytics groupwise
- Grouby internally uses 3 Strategies  > Split - Apply - Combine
- In 1st step it splits teh data into different groups
- In the 2nd step it applies the operations groupwise
- In final step it combines the result into pandas data frame

- **grp3=data.groupby(['City','Temperature'])**
- **The splitting in performed based on City then Temperature**
- **First grouping is based on City**
### With in each city , we are grouping based on Temperature

In [1011]:
import pandas as pd
dic={
    'City': ['Islamabad','Islamabad','Layyah','Layyah','Karachi','Lahore'],
    'Temperature': [35,     35,        45,      98,        17,     45],
    'Humidity':    [50,     60,        50,      60,        97,     70]
}

data=pd.DataFrame(dic)
data

        City  Temperature  Humidity
0  Islamabad           35        50
1  Islamabad           35        60
2     Layyah           45        50
3     Layyah           98        60
4    Karachi           17        97
5     Lahore           45        70

### 1. Display Average Temperature

In [1012]:
print("Mean of Temperature is:")
print(data['Temperature'].mean())

Mean of Temperature is:
45.833333333333336

### 2.  Display Average Temperature CityWise

In [1013]:
# If we can find the temperature with the above method then what is the need of GroupBy Method?
#grp=data.groupby('City').sum().reset_index()
#grp=data.groupby('City').max().reset_index()
grp=data.groupby('City')['Temperature'].mean().reset_index()    # As according to the statement we only want the average temperatuer citywise

# Here 1st of all the data is divided into cities, then the operation of Temperature.mean() is performed on the data
grp

        City  Temperature
0  Islamabad         35.0
1    Karachi         17.0
2     Lahore         45.0
3     Layyah         71.5

### 3: Display all the groups [Iterate over the groups]

In [1014]:
grp3=data.groupby(['City','Temperature','Humidity'])
for key,value in grp3:
    print(key)
    print()
    print(value)

('Islamabad', np.int64(35), np.int64(50))

        City  Temperature  Humidity
0  Islamabad           35        50
('Islamabad', np.int64(35), np.int64(60))

        City  Temperature  Humidity
1  Islamabad           35        60
('Karachi', np.int64(17), np.int64(97))

      City  Temperature  Humidity
4  Karachi           17        97
('Lahore', np.int64(45), np.int64(70))

     City  Temperature  Humidity
5  Lahore           45        70
('Layyah', np.int64(45), np.int64(50))

     City  Temperature  Humidity
2  Layyah           45        50
('Layyah', np.int64(98), np.int64(60))

     City  Temperature  Humidity
3  Layyah           98        60

In [1015]:
grp2=data.groupby('City')
for key,value in grp2:
    print(key)
    print(value)

Islamabad
        City  Temperature  Humidity
0  Islamabad           35        50
1  Islamabad           35        60
Karachi
      City  Temperature  Humidity
4  Karachi           17        97
Lahore
     City  Temperature  Humidity
5  Lahore           45        70
Layyah
     City  Temperature  Humidity
2  Layyah           45        50
3  Layyah           98        60

In [1016]:
grp3=data.groupby(['City','Temperature','Humidity']).max().reset_index()
# What was the max temperature value of the same cities having same temperature 
grp3

        City  Temperature  Humidity
0  Islamabad           35        50
1  Islamabad           35        60
2    Karachi           17        97
3     Lahore           45        70
4     Layyah           45        50
5     Layyah           98        60

### 4. Display the indices in each group

In [1017]:
grp2.groups

{'Islamabad': [0, 1], 'Karachi': [4], 'Lahore': [5], 'Layyah': [2, 3]}

### 5. Display the first/last entry in all the groups formed
- Basically, we use this when we have large number of enteries

In [1018]:
grp=data.groupby('City')
#grp
#grp.first()
grp.last()

           Temperature  Humidity
City
Islamabad           35        60
Karachi             17        97
Lahore              45        70
Layyah              98        60

### 6: Count the number of Enteries in each group

In [1019]:
grp.size()

City
Islamabad    2
Karachi      1
Lahore       1
Layyah       2
dtype: int64

### 7: Display a Specific group out of all the groups

In [1020]:
grp=data.groupby('City')
grp.get_group('Islamabad')

        City  Temperature  Humidity
0  Islamabad           35        50
1  Islamabad           35        60

### 8: Apply different functions to Groupby Groups [Like min,max,mean e.t.c]

In [1021]:
grp=data.groupby('City')
grp.min().reset_index()
grp.max().reset_index()
grp.sum().reset_index()

        City  Temperature  Humidity
0  Islamabad           70       110
1    Karachi           17        97
2     Lahore           45        70
3     Layyah          143       110

### 9: Display the Average temperature CityWise with Prefix Mean_Temp

In [1022]:
grp=data.groupby('City')['Temperature'] \
    .mean().add_prefix('Average_Temp_')    #.reset_index()
    
grp

City
Average_Temp_Islamabad    35.0
Average_Temp_Karachi      17.0
Average_Temp_Lahore       45.0
Average_Temp_Layyah       71.5
Name: Temperature, dtype: float64

### 10: Display the descriptive statistics groupwise

In [1023]:
grp=data.groupby('City')
grp.describe()

          Temperature                                                   \
                count  mean        std   min    25%   50%    75%   max
City
Islamabad         2.0  35.0   0.000000  35.0  35.00  35.0  35.00  35.0
Karachi           1.0  17.0        NaN  17.0  17.00  17.0  17.00  17.0
Lahore            1.0  45.0        NaN  45.0  45.00  45.0  45.00  45.0
Layyah            2.0  71.5  37.476659  45.0  58.25  71.5  84.75  98.0

          Humidity
             count  mean       std   min   25%   50%   75%   max
City
Islamabad      2.0  55.0  7.071068  50.0  52.5  55.0  57.5  60.0
Karachi        1.0  97.0       NaN  97.0  97.0  97.0  97.0  97.0
Lahore         1.0  70.0       NaN  70.0  70.0  70.0  70.0  70.0
Layyah         2.0  55.0  7.071068  50.0  52.5  55.0  57.5  60.0

### 11: Perform Statistical Computations Using agg() Function

In [1024]:
grp=data.groupby('City').agg(['min','max','mean'])
grp

          Temperature           Humidity
                  min max  mean      min max  mean
City
Islamabad          35  35  35.0       50  60  55.0
Karachi            17  17  17.0       97  97  97.0
Lahore             45  45  45.0       70  70  70.0
Layyah             45  98  71.5       50  60  55.0

In [1025]:
# Applying aggregate on specific column only 
grp=data.groupby('City')['Temperature'].agg(['min','max','mean'])
grp.reset_index()

        City  min  max  mean
0  Islamabad   35   35  35.0
1    Karachi   17   17  17.0
2     Lahore   45   45  45.0
3     Layyah   45   98  71.5

In [1026]:
# Applying aggregate on specific column only 
grp=data.groupby('City')['Humidity'].agg(['min','max','mean'])
grp.reset_index()

        City  min  max  mean
0  Islamabad   50   60  55.0
1    Karachi   97   97  97.0
2     Lahore   70   70  70.0
3     Layyah   50   60  55.0

### 12: Create a function to get the statistics Groupwise

In [1027]:
def fun(grp):
    return {'Min':grp.min(),
            'Mean':grp.mean()}

In [1028]:
grp=data.groupby('City').apply(fun)
grp

City
Islamabad    {'Min': [35, 50], 'Mean': [35.0, 55.0]}
Karachi      {'Min': [17, 97], 'Mean': [17.0, 97.0]}
Lahore       {'Min': [45, 70], 'Mean': [45.0, 70.0]}
Layyah       {'Min': [45, 50], 'Mean': [71.5, 55.0]}
dtype: object